In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 795.4 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [ ]:
%load_ext sql

Sql Extensions are needed that allow us to run sql in the notebook
%% sql is a  magic coommand

3. Loading our .db database to our runtime session

In [ ]:
%sql sqlite:///chinook.db /*the last part is the path to the file*/

Done.

[]

In [ ]:
%%sql
--This is a single line comment- the
/* This a multiple line
comment*/

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
SELECT *
FROM customers

limit 10

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4),
 (6, 'Helena', 'Holý', None, 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', '+420 2 4177 0449', None, 'hholy@gmail.com', 5),
 (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5),
 (8, 'Daan', 'Peeters', None, 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', '+32 02 219 03 03', None, 'daan_peeters@apple.be', 4),
 (9, 'Kara', 'Nielsen', None, 'Sønder Boulevard 51', 'Copenhagen', None, 'Denmark', '1720', '+453 3331 9991', None, 'kara.nielsen@jubii.dk', 4),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4)]

Entity relation diagram or data dictionary-Google to understand

In [ ]:
%sql PRAGMA table_info(invoices);

 * sqlite:///chinook.db
Done.

[(0, 'InvoiceId', 'INTEGER', 1, None, 1),
 (1, 'CustomerId', 'INTEGER', 1, None, 0),
 (2, 'InvoiceDate', 'DATETIME', 1, None, 0),
 (3, 'BillingAddress', 'NVARCHAR(70)', 0, None, 0),
 (4, 'BillingCity', 'NVARCHAR(40)', 0, None, 0),
 (5, 'BillingState', 'NVARCHAR(40)', 0, None, 0),
 (6, 'BillingCountry', 'NVARCHAR(40)', 0, None, 0),
 (7, 'BillingPostalCode', 'NVARCHAR(10)', 0, None, 0),
 (8, 'Total', 'NUMERIC(10,2)', 1, None, 0)]

In [ ]:
%sql SELECT Company FROM customers limit 10;

 * sqlite:///chinook.db
Done.

[('Embraer - Empresa Brasileira de Aeronáutica S.A.',),
 (None,),
 (None,),
 (None,),
 ('JetBrains s.r.o.',),
 (None,),
 (None,),
 (None,),
 (None,),
 ('Woodstock Discos',)]

In [ ]:
%sql SELECT COUNT FROM customers ;

 * sqlite:///chinook.db
(sqlite3.OperationalError) no such column: COUNT
[SQL: SELECT COUNT FROM customers ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql CREATE TABLE Worker2(
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    personal_number INT(6) NOT NULL PRIMARY KEY
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql ALTER TABLE Worker
ADD email VARCHAR(25);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type="table";

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('Worker',)]

In [ ]:
%sql PRAGMA table_info(Worker);

 * sqlite:///chinook.db
Done.

[(0, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (1, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (2, 'personal_number', 'INT(6)', 0, None, 0)]

In [ ]:
%%sql INSERT INTO Worker (first_name, last_name, personal_number) VALUES
('Fine', 'Finesse',12345),
('Fine', 'Finesse',12345);

 * sqlite:///chinook.db
2 rows affected.

[]

In [ ]:
%sql SELECT * FROM Worker;

 * sqlite:///chinook.db
Done.

[('Fine', 'Finesse', 12345, None), ('Fine', 'Finesse', 12345, None)]

In [ ]:
%sql PRAGMA table_info(Worker2);

 * sqlite:///chinook.db
Done.

[(0, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (1, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (2, 'personal_number', 'INT(6)', 1, None, 1)]

In [ ]:
%sql DROP TABLE Worker;

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%sql